bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
    /* Throttle source init — unconditional (Finding 42/54).
     * Priority: ADC_POT > RX_AUTO > RX_PWM > RX_DSHOT > GSP */
#if FEATURE_ADC_POT
    garudaData.throttleSource = THROTTLE_SRC_ADC;
#elif FEATURE_RX_AUTO
    garudaData.throttleSource = THROTTLE_SRC_AUTO;
#elif FEATURE_RX_PWM
    garudaData.throttleSource = THROTTLE_SRC_PWM;
#elif FEATURE_RX_DSHOT
    garudaData.throttleSource = THROTTLE_SRC_DSHOT;
#elif FEATURE_GSP
    garudaData.throttleSource = THROTTLE_SRC_GSP;
#endif

#if FEATURE_HW_OVERCURRENT
    garudaData.ibusRaw = 0;
    garudaData.ibusMax = 0;
    garudaData.clpciTripCount = 0;
    garudaData.fpciTripCount = 0;
#endif

    garudaData.bemf.bemfRaw = 0;
    garudaData.bemf.zcThreshold = 0;
    garudaData.bemf.zcAmpForFilterComp = 0;
    garudaData.bemf.fallOffBemfMin = 0xFFFF;  /* falling OFF-center envelope */
    garudaData.bemf.fallOffBemfMax = 0;
    garudaData.bemf.zeroCrossDetected = false;
    garudaData.bemf.cmpPrev = 0xFF;
    garudaData.bemf.cmpExpected = 0;
    garudaData.bemf.filterCount = 0;
    garudaData.bemf.ad2SettleCount = 0;
    garudaData.bemf.bemfSampleValid = true;
    garudaData.bemf.phaseBHigh = 0;
    garudaData.bemf.phaseBLow = 0;
    garudaData.bemf.phaseBHighValid = false;
    garudaData.bemf.phaseBLowValid = false;
    garudaData.bemf.measuredNeutral = 0;
    garudaData.bemf.neutralValid = false;
    garudaData.bemf.zcNeutral[0] = 0;
    garudaData.bemf.zcNeutral[1] = 0;
    garudaData.bemf.zcNeutral[2] = 0;
    garudaData.bemf.zcNeutralCount[0] = 0;
    garudaData.bemf.zcNeutralCount[1] = 0;
    garudaData.bemf.zcNeutralCount[2] = 0;

    garudaData.timing.stepPeriod = 0;
    garudaData.timing.lastCommTick = 0;
    garudaData.timing.lastZcTick = 0;
    garudaData.timing.prevZcTick = 0;
    garudaData.timing.zcInterval = 0;
    garudaData.timing.commDeadline = 0;
    garudaData.timing.forcedCountdown = 0;
    garudaData.timing.goodZcCount = 0;
    garudaData.timing.consecutiveMissedSteps = 0;
    garudaData.timing.stepsSinceLastZc = 0;
    for (uint8_t i = 0; i < 6; i++)
        garudaData.timing.stepMissCount[i] = 0;
    garudaData.timing.risingZcWorks = false;
    garudaData.timing.fallingZcWorks = false;
    garudaData.timing.zcSynced = false;
    garudaData.timing.deadlineActive = false;
    garudaData.timing.hasPrevZc = false;
#if FEATURE_BEMF_INTEGRATION || FEATURE_ADC_CMP_ZC
    garudaData.timing.deadlineIsZc = false;
#endif

    /* ISR priority setup */
#if FEATURE_ADC_CMP_ZC
    _AD1CH0IP = 6;      /* ADC ISR lowered from 7 to 6 when HW ZC available */
    _AD1CMP5IP = 7;     /* AD1 comparator CH5: highest priority */
    _AD2CMP1IP = 7;     /* AD2 comparator CH1: highest priority */
    _CCT1IP = 7;        /* SCCP1 timer: highest priority */
#endif

    /* Clear any latched PCI fault from previous run (U25B is latching).
     * Must happen before enabling ADC ISR, otherwise the first PWM
     * edge re-triggers the fault immediately. */
    HAL_MC1ClearPWMPCIFault();
    HAL_MC1PWMDisableOutputs();

    /* Enable ADC interrupt to start the control loop */
    GARUDA_ClearADCIF();
    GARUDA_EnableADCInterrupt();

#if FEATURE_ADC_CMP_ZC
    HWZC_Init(&garudaData);
    SPEED_PI_Init(&garudaData);
    HAL_ADC_InitHighSpeedBEMF();
    HAL_SCCP1_Init();
    HAL_SCCP2_Init();
    HAL_SCCP3_InitPeriodic(HWZC_SCCP3_PERIOD);  /* Start high-speed ADC trigger */
#endif

#if FEATURE_LEARN_MODULES
    LEARN_ServiceInit(&garudaData);
#endif
}

/**
 * @brief ADC ISR — runs at PWM rate (24kHz).
 * Reads BEMF/Vbus, runs state machine, updates PWM.
 * Phase 2: sole commutation owner for CLOSED_LOOP state
 * (bypassed when DIAGNOSTIC_MANUAL_STEP=1).
 */
void __attribute__((__interrupt__, no_auto_psv)) GARUDA_ADC_INTERRUPT(void)
{
    /* Read all ADC buffers. MUST read AD1CH0DATA first — interrupt source.
     * Reading clears data-ready condition on dsPIC33AK. */
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
    /* FOC: AD1CH0 = Ia (OA1OUT), AD2CH0 = Ib (OA2OUT) — raw uint16_t */
    uint16_t raw_ia = ADCBUF_IA;
    uint16_t raw_ib = ADCBUF_IB;
#else
    /* 6-step: AD1CH0 = Phase B voltage (RB8), AD2CH0 = Phase A/C (muxed) */
    uint16_t phaseB_val = ADCBUF_PHASE_B;
    uint16_t phaseAC_val = ADCBUF_PHASE_AC;
#endif
    garudaData.vbusRaw = ADCBUF_VBUS;
    garudaData.potRaw = ADCBUF_POT;

    /* Throttle source mux — unconditional switch (Finding 53/56) */
    switch (garudaData.throttleSource) {
#if FEATURE_GSP
        case THROTTLE_SRC_GSP:
            garudaData.throttle = (uint16_t)((uint32_t)garudaData.gspThrottle * 4095 / 2000);
            break;
#endif
#if (FEATURE_RX_PWM || FEATURE_RX_DSHOT || FEATURE_RX_AUTO)
        case THROTTLE_SRC_PWM:
        case THROTTLE_SRC_DSHOT:
        case THROTTLE_SRC_AUTO:
            garudaData.throttle = rxCachedLocked ? rxCachedThrottleAdc : 0;
            break;
#endif
#if FEATURE_ADC_POT
        case THROTTLE_SRC_ADC:
            garudaData.throttle = garudaData.potRaw;
            break;
#endif
        default:
            /* Safety fallback — zero throttle for corrupted enum or disabled source.
             * Never reads floating ADC. (Finding 56) */
            garudaData.throttle = 0;
            break;
    }

#if FEATURE_BEMF_CLOSED_LOOP
    /* Capture entry state for transition detection. Must be saved before
     * any state changes (morph→CL etc.) so the NEXT tick sees the transition. */
    ESC_STATE_T entryState = garudaData.state;

    /* P1 DISABLED: Phase B rail-based measuredNeutral gives correct Phase B
     * midpoint (24 at low duty) but is 30% lower than the duty-proportional
     * value (34). Since HWZC uses zcThreshold directly (hwzc.c:169) for its
     * ADC comparator, the lower threshold pushes the comparator near the noise
     * floor → massive noise rejections (NW6: 75k rejects vs NW4: 20k) →
     * HWZC miss rate 26.7% → latch-off → software ZC fallback → failure.
     *
     * Phase B tracking still runs for diagnostic visibility in watch data. */
    if (garudaData.state == ESC_CLOSED_LOOP
#if FEATURE_SINE_STARTUP
        || (garudaData.state == ESC_MORPH
            && (garudaData.morph.subPhase == MORPH_HIZ
                || garudaData.morph.subPhase == MORPH_WINDOWED_HIZ))
#endif
       )
    {
        PHASE_STATE_T bRole = commutationTable[garudaData.currentStep].phaseB;
        if (bRole == PHASE_PWM_ACTIVE)
        {
            garudaData.bemf.phaseBHigh = phaseB_val;
            garudaData.bemf.phaseBHighValid = true;
            if (garudaData.bemf.phaseBLowValid)
            {
                garudaData.bemf.measuredNeutral =
                    (garudaData.bemf.phaseBHigh + garudaData.bemf.phaseBLow) >> 1;
                garudaData.bemf.neutralValid = true;
            }
        }
        else if (bRole == PHASE_LOW)
        {
            garudaData.bemf.phaseBLow = phaseB_val;
            garudaData.bemf.phaseBLowValid = true;
            if (garudaData.bemf.phaseBHighValid)
            {
                garudaData.bemf.measuredNeutral =
                    (garudaData.bemf.phaseBHigh + garudaData.bemf.phaseBLow) >> 1;
                garudaData.bemf.neutralValid = true;
            }
        }
        /* Steps 2,5: B=FLOAT — no update, use cached measuredNeutral */
    }

    /* ZC threshold: duty-proportional (P0) with symmetric IIR (P3).
     * P0: Exact division replaces >>18 shift (+1.7% bias fix).
     * P1 measured neutral disabled — see comment above. */
    static uint16_t zcThreshSmooth = 0;
    {
        /* P0: Duty-proportional threshold — always used.
         * Exact division replaces >>18 shift (+1.7% bias fix). */
        uint16_t rawThresh = (uint16_t)(
            ((uint32_t)garudaData.vbusRaw * garudaData.duty) / ZC_DUTY_DIVISOR);

        if (garudaData.state == ESC_CLOSED_LOOP
#if FEATURE_SINE_STARTUP
            || (garudaData.state == ESC_MORPH
                && (garudaData.morph.subPhase == MORPH_HIZ
                    || garudaData.morph.subPhase == MORPH_WINDOWED_HIZ))
#endif
           )
        {
            if (prevAdcState != ESC_CLOSED_LOOP
#if FEATURE_SINE_STARTUP
                && !(garudaData.state == ESC_MORPH
                     && (garudaData.morph.subPhase == MORPH_HIZ
                         || garudaData.morph.subPhase == MORPH_WINDOWED_HIZ)
                     && prevAdcState == ESC_MORPH)
#endif
               )
            {
                zcThreshSmooth = rawThresh;

                /* P1: Reset measured neutral on CL entry — start fresh each run */
                garudaData.bemf.neutralValid = false;
                garudaData.bemf.phaseBHighValid = false;
                garudaData.bemf.phaseBLowValid = false;
                garudaData.bemf.phaseBHigh = 0;
                garudaData.bemf.phaseBLow = 0;
                garudaData.bemf.zcNeutralCount[0] = 0;
                garudaData.bemf.zcNeutralCount[1] = 0;
                garudaData.bemf.zcNeutralCount[2] = 0;
            }
#if FEATURE_SINE_STARTUP
            /* Guardrail #7: only consume in windowed context — stale flag
             * from a prior run can't accidentally reseed during normal CL. */
            else if (garudaData.morph.forceThreshSeed
                     && garudaData.state == ESC_MORPH
                     && garudaData.morph.subPhase == MORPH_WINDOWED_HIZ)
            {
                zcThreshSmooth = rawThresh;
                garudaData.morph.forceThreshSeed = false;
            }
#endif
            else
            {
                /* P3: Symmetric IIR — 1/4 gain both directions, tau ~4 ticks = 0.17ms.
                 * Replaces asymmetric (fast rise 0.33ms, slow fall 10.7ms) that
                 * caused threshold lag during deceleration. */
                int16_t delta = (int16_t)rawThresh - (int16_t)zcThreshSmooth;
                zcThreshSmooth += (delta + 2) >> 2;
            }
            garudaData.bemf.zcThreshold = zcThreshSmooth;
        }
        else
        {
            zcThreshSmooth = rawThresh;  /* Non-CL: instant tracking */
            garudaData.bemf.zcThreshold = rawThresh;
        }

#if FEATURE_HWZC_FILTER_COMP
        /* Slow-IIR amplitude estimate for filter-comp offset magnitude.
         * Time constant 2^11 × (1/PWMFREQ) ≈ 2048 / 45kHz = 46 ms — long
         * enough that a step duty change doesn't instantly inflate the
         * filter-comp offset, but fast enough to converge within ~150 ms
         * of any sustained operating point. This decouples the offset
         * magnitude from the fast zcThreshold IIR, which prevents the
         * 4000-sector PI drift that bit Phase A at 75%+ duty.
         *
         * Seeded to zcThreshold on first tick to avoid a long start-up
         * convergence (zcAmpForFilterComp==0 would over-cancel comp at
         * startup). Non-CL path also resets to current zcThreshold so
         * morph→CL handoff doesn't carry stale state. */
        if (garudaData.bemf.zcAmpForFilterComp == 0) {
            garudaData.bemf.zcAmpForFilterComp = garudaData.bemf.zcThreshold;
        } else {
            int32_t ampDelta = (int32_t)garudaData.bemf.zcThreshold
                             - (int32_t)garudaData.bemf.zcAmpForFilterComp;
            garudaData.bemf.zcAmpForFilterComp =
                (uint16_t)((int32_t)garudaData.bemf.zcAmpForFilterComp
                           + (ampDelta >> 11));   /* ~46 ms time constant */
        }
        if (garudaData.state != ESC_CLOSED_LOOP) {
            /* Out of CL — keep tracking instantaneously so we're ready
             * for next CL entry with a sensible seed. */
            garudaData.bemf.zcAmpForFilterComp = garudaData.bemf.zcThreshold;
        }
#endif

#if FEATURE_ADC_CMP_ZC
        /* Live CMPLO refresh while HWZC is actively watching for a crossing.
         * Without this, CMPLO is only written at OnCommutation, so it stays
         * stale for up to one sector period (~91 µs at 100k eRPM, much longer
         * at low speed). Updating every 24 kHz tick tracks Vbus sag and duty
         * ramp mid-sector, which matters under load / during pot slew.
         *
         * Safety:
         *   - Gated on HWZC_WATCHING — during BLANKING/COMM_PENDING the
         *     comparator IE is disabled anyway.
         *   - CMPLO write is atomic (single 32-bit SFR).
         *   - CMPMOD is left untouched (set per-commutation in OnCommutation).
         *   - Deadband applied per-polarity, matching OnCommutation semantics.
         */
        if (garudaData.hwzc.enabled
            && garudaData.hwzc.phase == HWZC_WATCHING)
        {
            int8_t pol = commutationTable[garudaData.currentStep].zcPolarity;
            uint16_t t = garudaData.bemf.zcThreshold;
            /* Filter-lag pre-distortion mirrors what HWZC_OnCommutation applied
             * — keep the live refresh in lockstep so CMPLO stays compensated
             * as zcThreshold drifts with Vbus/duty mid-sector. */
            t = HWZC_ApplyFilterComp(&garudaData, t, (pol > 0));
            if (pol > 0)
                t = (t + HWZC_CMP_DEADBAND < 4095) ? t + HWZC_CMP_DEADBAND : 4095;
            else
                t = (t > HWZC_CMP_DEADBAND) ? t - HWZC_CMP_DEADBAND : 0;
            HAL_ADC_UpdateComparatorThreshold(garudaData.hwzc.activeCore, t);
        }
#endif
    }
#else
    garudaData.bemf.zcThreshold = garudaData.vbusRaw >> 1;
#endif

#if FEATURE_BEMF_CLOSED_LOOP
    /* Store floating phase ADC value in bemfRaw with validity tracking */
    {
        uint8_t fp = commutationTable[garudaData.currentStep].floatingPhase;
        if (fp == FLOATING_PHASE_B)
        {
            garudaData.bemf.bemfRaw = phaseB_val;
            garudaData.bemf.bemfSampleValid = true;
        }
        else if (garudaData.bemf.ad2SettleCount > 0)
        {
            garudaData.bemf.bemfRaw = phaseAC_val;
            garudaData.bemf.bemfSampleValid = false;
            garudaData.bemf.ad2SettleCount--;
        }
        else
        {
            garudaData.bemf.bemfRaw = phaseAC_val;
            garudaData.bemf.bemfSampleValid = true;
        }

#if FEATURE_ADC_CMP_ZC
        /* Diagnostic: falling-sector OFF-center BEMF envelope. Capture bemfRaw
         * (OFF-center floating sample) only while a FALLING sector is in the
         * WATCHING window — proves whether the falling crossing is visible at
         * OFF-center (envelope brackets zcThreshold) vs the silent ON-time
         * comparator. Cheap: 2 compares per tick, diagnostic only. */
        if (garudaData.hwzc.enabled
            && garudaData.hwzc.phase == HWZC_WATCHING
            && garudaData.bemf.bemfSampleValid
            && commutationTable[garudaData.currentStep].zcPolarity < 0)
        {
            uint16_t vfo = garudaData.bemf.bemfRaw;
            if (vfo < garudaData.bemf.fallOffBemfMin) garudaData.bemf.fallOffBemfMin = vfo;
            if (vfo > garudaData.bemf.fallOffBemfMax) garudaData.bemf.fallOffBemfMax = vfo;

