bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
        /* FOC v2 uses raw_ia/raw_ib already read at ISR entry */
        uint16_t throttle_v2 = garudaData.throttle;

        float da_v2, db_v2, dc_v2;
        foc_v2_fast_tick(&s_foc_v2,
                         raw_ia, raw_ib,
                         garudaData.vbusRaw, throttle_v2,
                         &da_v2, &db_v2, &dc_v2);

        /* Release PWM overrides when entering active modes */
        {
            static bool v2_ovr_released = false;
            if ((s_foc_v2.mode >= FOC_MOTOR_DETECT && s_foc_v2.mode <= FOC_CLOSED_LOOP)) {
                if (!v2_ovr_released) {
                    HAL_PWM_ReleaseAllOverrides();
                    v2_ovr_released = true;
                }
                HAL_PWM_SetDutyFloat3Phase(da_v2, db_v2, dc_v2);
            } else if (s_foc_v2.mode == FOC_FAULT && v2_ovr_released) {
                /* Fault: force 50% duty (zero net voltage) to stop motor */
                HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
            } else {
                v2_ovr_released = false;
            }
        }

        /* After detect completes: write ALL detected + derived params back
         * to gspParams BEFORE state mapping (ESC_DETECT → ESC_ARMED).
         * This ensures SAVE_CONFIG persists a complete, self-consistent set
         * that produces the same FOC behavior after MCU reset. */
        if (s_foc_v2.mode == FOC_ARMED && garudaData.state == ESC_DETECT) {
            /* Motor params */
            gspParams.focRsMilliOhm    = (uint16_t)(s_foc_v2.Rs * 1000.0f + 0.5f);
            gspParams.focLsMicroH      = (uint16_t)(s_foc_v2.Ls * 1e6f + 0.5f);
            gspParams.focKeUvSRad      = (uint16_t)(s_foc_v2.Ke * 1e6f + 0.5f);
            /* PI gains (pole cancellation from detected Rs, Ls) */
            gspParams.focKpDqMilli     = (uint16_t)(s_foc_v2.pid_d.kp * 1000.0f + 0.5f);
            gspParams.focKiDq          = (uint16_t)(s_foc_v2.pid_d.ki + 0.5f);
            /* Max speed from Vbus/Ke */
            gspParams.focMaxElecRadS   = (uint16_t)(s_foc_v2.max_elec_rad_s + 0.5f);
            /* Startup params */
            gspParams.focHandoffRadS   = (uint16_t)(s_foc_v2.handoff_rad_s + 0.5f);
            gspParams.focRampRateRps2  = (uint16_t)(s_foc_v2.ramp_rate + 0.5f);
            gspParams.focAlignIqCentiA = (uint16_t)(s_foc_v2.align_iq * 100.0f + 0.5f);
            gspParams.focRampIqCentiA  = (uint16_t)(s_foc_v2.ramp_iq * 100.0f + 0.5f);
            gspParams.focFaultOcCentiA = (uint16_t)(s_foc_v2.fault_oc_a * 100.0f + 0.5f);
        }

        /* Map FOC v2 mode to ESC state for main loop compatibility.
         * Don't overwrite ESC_DETECT when FOC is still IDLE — main loop
         * sets ESC_DETECT, ISR must not clobber it before processing. */
        switch (s_foc_v2.mode) {
            case FOC_IDLE:
                if (garudaData.state != ESC_DETECT)
                    garudaData.state = ESC_IDLE;
                break;
            case FOC_ARMED:        garudaData.state = ESC_ARMED; break;
            case FOC_MOTOR_DETECT: garudaData.state = ESC_DETECT; break;
            case FOC_ALIGN:        garudaData.state = ESC_ALIGN; break;
            case FOC_IF_RAMP:      garudaData.state = ESC_OL_RAMP; break;
            case FOC_CLOSED_LOOP:  garudaData.state = ESC_CLOSED_LOOP; break;
            case FOC_FAULT:        garudaData.state = ESC_FAULT; break;
            default:               garudaData.state = ESC_FAULT; break;
        }

        /* Fault propagation */
        if (s_foc_v2.mode == FOC_FAULT) {
            HAL_MC1PWMDisableOutputs();
            if (garudaData.faultCode == FAULT_NONE)
                garudaData.faultCode = s_foc_v2.fault_code ? s_foc_v2.fault_code : FAULT_FOC_INTERNAL;
            garudaData.runCommandActive = false;
            LED2 = 0;
        }

        /* Telemetry update */
#if FEATURE_FOC_V2
        garudaData.focIdMeas   = s_foc_v2.id_meas;
        garudaData.focIqMeas   = s_foc_v2.iq_meas;
        garudaData.focTheta    = (s_foc_v2.mode == FOC_MOTOR_DETECT)
                                   ? s_foc_v2.theta_if : s_foc_v2.theta;
        garudaData.focOmega    = (s_foc_v2.mode == FOC_MOTOR_DETECT)
                                   ? s_foc_v2.omega_if : s_foc_v2.omega_pll;
        garudaData.focVbus     = s_foc_v2.vbus;
        garudaData.focIa       = v2_counts_to_amps(raw_ia, (uint16_t)s_foc_v2.ia_offset);
        garudaData.focIb       = v2_counts_to_amps(raw_ib, (uint16_t)s_foc_v2.ib_offset);
        garudaData.focThetaObs = s_foc_v2.theta_obs;
        garudaData.focVd       = s_foc_v2.vd;
        garudaData.focVq       = s_foc_v2.vq;
        /* Observer internals */
        garudaData.focFluxAlpha   = s_foc_v2.obs.x1;
        garudaData.focFluxBeta    = s_foc_v2.obs.x2;
        garudaData.focLambdaEst   = s_foc_v2.obs.lambda_est;
        garudaData.focObsGain     = s_foc_v2.obs.gain;
        /* PI controller internals */
        garudaData.focPidDInteg   = s_foc_v2.pid_d.integral;
        garudaData.focPidQInteg   = s_foc_v2.pid_q.integral;
        garudaData.focPidSpdInteg = s_foc_v2.pid_spd.integral;
        /* Derived diagnostics */
        {
            float vd = s_foc_v2.vd, vq = s_foc_v2.vq;
            float vbus = s_foc_v2.vbus;
            float v_mag = sqrtf(vd * vd + vq * vq);
            float v_max = vbus * 0.57735027f;  /* 1/sqrt(3) */
            garudaData.focModIndex = (v_max > 0.1f) ? (v_mag / v_max) : 0.0f;

            float fx = s_foc_v2.obs.x1, fy = s_foc_v2.obs.x2;
            float flux_mag = sqrtf(fx * fx + fy * fy);
            float lam = s_foc_v2.lambda_pm;
            garudaData.focObsConfidence = (lam > 0.0f)
                ? (1.0f - fabsf(flux_mag - lam) / lam) : 0.0f;
            if (garudaData.focObsConfidence < 0.0f)
                garudaData.focObsConfidence = 0.0f;
        }
        garudaData.focSubState = (s_foc_v2.mode == FOC_MOTOR_DETECT)
                                   ? (uint8_t)s_foc_v2.detect_state
                                   : s_foc_v2.sub_state;
        garudaData.focOffsetIa = (uint16_t)s_foc_v2.ia_offset;
        garudaData.focOffsetIb = (uint16_t)s_foc_v2.ib_offset;

