bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                    /* IIR filter always runs (keeps filter warm during pre-sync) */
                    vbusFiltered = (uint16_t)(
                        ((uint32_t)vbusFiltered * 7 + garudaData.vbusRaw) >> 3);

#if FEATURE_PRESYNC_RAMP
                    /* Bypass sag limiter during pre-sync: at 12V CC-limited supply,
                     * vbus sags to ~636 ADC (8.9V) under startup load. With
                     * VBUS_SAG_THRESHOLD_ADC=900, the sag limiter would reduce
                     * RAMP_DUTY_CAP by ~26%, killing startup torque. Allow full
                     * startup duty until ZC sync is achieved. */
                    if (garudaData.timing.zcSynced)
                    {
#endif
                    if (!vbusSagActive && vbusFiltered < VBUS_SAG_THRESHOLD_ADC)
                        vbusSagActive = true;
                    else if (vbusSagActive && vbusFiltered > VBUS_SAG_RECOVERY_ADC)
                        vbusSagActive = false;

                    if (vbusSagActive)
                    {
                        uint32_t sagDepth = (vbusFiltered < VBUS_SAG_THRESHOLD_ADC) ?
                            (VBUS_SAG_THRESHOLD_ADC - vbusFiltered) : 0;
                        uint32_t reduction = (sagDepth * VBUS_SAG_GAIN) >> 4;
                        if (reduction >= mappedDuty)
                            mappedDuty = MIN_DUTY;
                        else
                            mappedDuty -= reduction;
                    }
#if FEATURE_PRESYNC_RAMP
                    }
                    else
                    {
                        vbusSagActive = false;  /* Reset so it re-evaluates on sync */
                    }
#endif

                    if (mappedDuty < MIN_DUTY)
                        mappedDuty = MIN_DUTY;
                }
#endif

#if FEATURE_HW_OVERCURRENT
                /* Software bus current soft limiter — proportional duty reduction.
                 * Ramps down duty smoothly BEFORE CMP3/CLPCI hardware trips. */
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC)
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    uint32_t reduction = ((uint32_t)excess * (mappedDuty - MIN_DUTY)) / range;
                    if (reduction >= mappedDuty - MIN_DUTY)
                        mappedDuty = MIN_DUTY;
                    else
                        mappedDuty -= reduction;
                }
#endif

                garudaData.duty = mappedDuty;
            }
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
        }
#else  /* !FEATURE_BEMF_CLOSED_LOOP — Phase 1 open-loop path */
        case ESC_CLOSED_LOOP:
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
#endif

        case ESC_BRAKING:
            break;

        case ESC_RECOVERY:
            /* PWM already disabled on entry — coast-down handled in Timer1 */
            break;

        case ESC_FAULT:
            HAL_MC1PWMDisableOutputs();
            break;
    }
#endif /* !FEATURE_FOC && !FEATURE_FOC_V2 && !FEATURE_FOC_V3 && !FEATURE_FOC_AN1078 — end of 6-step state machine */

#if FEATURE_BEMF_CLOSED_LOOP
    /* Track state for transition detection (must be last before flag clear).
     * Use entryState (not garudaData.state) so mid-ISR state changes
     * (e.g. morph→CL) are visible on the NEXT tick. */
#if FEATURE_SPEED_PI
    /* Disable speed PI when leaving CL state. Cleanup so SPEED_PI_OnZcEvent
     * (called from HWZC ISR) no-ops until next CL re-entry. Bumpless on
     * re-enable because Enable seeds integrator from current duty. */
    if (entryState == ESC_CLOSED_LOOP
        && garudaData.state != ESC_CLOSED_LOOP
        && garudaData.speedPi.enabled)
        SPEED_PI_Disable(&garudaData);
#endif
    prevAdcState = entryState;
#endif

    /* X2CScope: sample variables at ADC rate (24kHz) */
#ifdef ENABLE_DIAGNOSTICS
    DiagnosticsStepIsr();
#endif

    /* Clear interrupt flag AFTER reading all buffers (matches reference) */
    GARUDA_ClearADCIF();
}

/**
 * @brief Timer1 ISR — 100us tick.
 * Handles: heartbeat LED, board service, commutation timing for
 * align/ramp states, 1ms system tick.
 */
void __attribute__((__interrupt__, no_auto_psv)) _T1Interrupt(void)
{
    /* Heartbeat LED — toggle at ~2Hz (250ms) */
    heartbeatCounter++;
    if (heartbeatCounter >= HEART_BEAT_LED_COUNT)
    {
        heartbeatCounter = 0;
        if (LED1 == 1)
            LED1 = 0;
        else
            LED1 = 1;
    }

    /* Board service step (drives button debounce at 1ms) */
    BoardServiceStepIsr();

    /* 1ms system tick sub-counter (10 x 100us = 1ms) */
    msSubCounter++;
    if (msSubCounter >= 10)
    {
        msSubCounter = 0;
        garudaData.systemTick++;
    }

    /* State-specific processing at 100us rate */
    switch (garudaData.state)
    {
        case ESC_IDLE:
            /* Nothing — waiting for button press in main loop */
            break;

        case ESC_ARMED:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: arming handled in ADC ISR slow loop (1kHz) to avoid
             * cross-ISR races. Timer1 is a no-op for ESC_ARMED with FOC. */
            break;
#else
            /* Verify throttle stays at zero for ARM_TIME */
            if (garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
            {
                garudaData.armCounter++;
                if (garudaData.armCounter >= ARM_TIME_COUNTS)
                {
                    /* Armed successfully — transition to ALIGN.
                     * Init before state change: ADC ISR (prio 6) can
                     * preempt Timer1 (prio 5) between the two lines. */
                    STARTUP_Init(&garudaData);
                    garudaData.state = ESC_ALIGN;
                    LED2 = 1; /* Motor running indicator */
                }
            }
            else
            {
                garudaData.armCounter = 0; /* Reset if throttle not zero */
            }
            break;
#endif

        case ESC_ALIGN:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: alignment handled in ADC ISR. Timer1 is a no-op. */
            break;
#elif FEATURE_SINE_STARTUP
            if (STARTUP_SineAlign(&garudaData))
                garudaData.state = ESC_OL_RAMP;
            break;
#else
            if (STARTUP_Align(&garudaData))
            {
                garudaData.state = ESC_OL_RAMP;
                garudaData.rampCounter = garudaData.rampStepPeriod;
            }
            break;
#endif

